{"name":"Sarah","text":"## Les logiciel libres \n\nÀ l'époque des débuts d'Internet et jusque dans le milieu des années 70, l'informatique et les logiciels se développent dans des systèmes ouverts. UNIX était distribué gratuitement et les codes sources des programmes circulaient librement. Avec l'arrivée du Personal Computer et donc de la démocratisation de l'informatique, les logiciels et les PC se transforment en objets de consommation courante. Les logiciels deviennent propriétaires afin de financer le développement des softwares et de générer des profits. Les entreprises qui rachètent des logiciels ferment leurs codes sources. Au début des années 80, Richard Stallman, scientifique, hacker et programmeur qui a notamment fait ses armes au MIT, se trouve dans son laboratoire de recherche et veut imprimer sur la Xerox du labo. L'imprimante a un problème de bourrage de papier et l'empêche d'imprimer. Stallman décide alors de programmer un pilote pour que cette erreur ne se reproduise plus. Malheureusement, il lui est impossible d'implémenter son pilote dans le code source de l'imprimante. Le code source est complètement fermé. Très frustré de cette mésaventure, il décide de lancer en 1983 le projet GNU (Gnu's Not Unix) qui donnera naissance au projet GNU/Linux. GNU est un système d'exploitation libre qui permet l'utilisation de tous les logiciels libres. GNU n'est pas seulement un projet technique, il est surtout une invention d'ordre juridique, dans l'esprit des pionniers du web. GNU génère la General Public License qui fixe les conditions légales de distribution des logiciels libres. La GPL met en oeuvre la notion de copyleft (jeu de mot avec copyright : droits d'auteur / gauches d'auteur). L'objectif de la license GNU GPL est de garantir à l'utilisateur les droits suivants sur un programme informatique :   \n\n## Les 4 libertés \n \n« Liberté 0 : Exécuter le programme, pour tous les usages.\nLiberté 1 : La liberté d’étudier le fonctionnement du programme, et de l’adapter à vos besoins. Pour ceci l’accès au code source est une condition requise.\nLiberté 2 : La liberté de redistribuer des copies, donc d’aider votre voisin.\nLiberté 3 : La liberté de distribuer des copies de vos versions modifiées à d’autres. En faisant cela, vous pouvez faire profiter toute la communauté de vos changements. L’accès au code source est une condition requise. » "}